using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Stat
{
      public string playerName;
      public int currentRoom;
      public bool guideShown;




      public string[][][] qa;
      
      
      
      
      
      
      
      
      
      private static Stat _ins;
      public static Stat Ins
      {
            get
            {
                  if (_ins == null)
                        _ins = new Stat();
                  return _ins;
            }
      }

      private Stat()
      {
            currentRoom = 0;
            playerName = "فلان بن فلان";
            guideShown = false;

            qa = new string[][][]
            {
                  new string[][]
                  {
                        new string[]
                        {
                              "پس از وقوع سیل در استان سیستان و بلوچستان، کدام یک از انواع شبکه‌های زیر در بسیج منابع، نقش پررنگ‌تری خواهد داشت؟",
                              "شبکه‌های سازمانی", "شبکه‌های مجازی", "شبکه‌های دوستانه", "شبکۀ خانوادگی"
                        },
                        new string[]
                        {
                              "کدام یک از مهارت‌ها (شایستگی‌های) مدیریتی زیر، جهت مهار دشواری‌های حادثۀ سیل ضروری است؟",
                              "قاطعیت و ثبات رأی", "اقناع کنندگی", "مدیریت بحران توأم با توکل", "تحوّل‌خواهی انقلابی"
                        },
                        new string[]
                        {
                              "یک فرماندۀ ناحیه بسیج که در روزهای پس از سیل استان سیستان از ظرفیت شبکۀ خود در راستای کمک به حلّ بحران‌های ناشی از سیل بهره می‌گیرد، کدام یک از موارد ذیل را نمی‌تواند به شبکه بسپارد؟",
                              "بسترسازی پشتیبانی از شبکه", "رصد و پایش از طریق شبکه", "هماهنگی و برنامه ریزی در شبکه‌ها", "تصمیم‌سازی و تصمیم‌گیری شبکه‌ای"
                        },
                        new string[]
                        {
                              "کدام یک از شایستگی‌های زیر در بسیج‌کنندگی نیروها در موقعیت سیل بروز بیشتری دارد؟",
                              "شجاعت", "آشنایی با روش‌های بوم‌شناسی", "بصیرت انقلابی", "محاسبه نفس"
                        },
                        new string[]
                        {
                              "آیا می‌توان از ظرفیت خواهران در مدیریت بحران سیل استان سیستان و بلوچستان استفاده کرد؟",
                              "به دلیل خطرناک بودن موقعیت امکان‌پذیر نیست.", "حتماً و باید از کمک خواهران استفاده کرد.", "شاید در عمل چنین امری محقّق نشود.", "بهتر است این امر بر عهدۀ برادران باقی بماند."
                        },
                        new string[]
                        {
                              "",
                              "", "", "", ""
                        },
                        new string[]
                        {
                              "",
                              "", "", "", ""
                        },
                        new string[]
                        {
                              "",
                              "", "", "", ""
                        },
                        new string[]
                        {
                              "",
                              "", "", "", ""
                        },
                        new string[]
                        {
                              "",
                              "", "", "", ""
                        }
                  }
            };
      }
}

