namespace MainScripts
{
    public class Stat
    {
        private string playerName;

        public string PlayerName
        {
            get => playerName;
            set
            {
                playerName = value;
                UIManager._.SetPlayerName();
            }
        }

        private int score;

        public int Score
        {
            get => score;
            set
            {
                score = value;
                UIManager._.SetScore();
            }
        }

        private int level;

        public int Level
        {
            get => level;
            set
            {
                level = value;
                UIManager._.SetLevel();
            }
        }


        public readonly Game[] games;
        private static Stat _ins;

        public static Stat Ins
        {
            get
            {
                if (_ins == null)
                    _ins = new Stat();
                return _ins;
            }
        }

        private Stat()
        {
            playerName = "فلان بن فلان";
            score = 0;
            level = 0;

            games = new[]
            {
                new Game("یگان مهندسی نیروی زمینی سپاه تهران", GameStyle.Question, new[]
                {
                    new DBQuestion(
                        new[]
                        {
                            "1 - پس از وقوع سیل در استان سیستان و بلوچستان، کدام یک از انواع شبکه های زیر در بسیج منابع، نقش پررنگ تری خواهد داشت؟",
                            "شبکه های سازمانی", "شبکه های مجازی", "شبکه های دوستانه", "شبکۀ خانوادگی"
                        }, 2),
                    new DBQuestion(
                        new[]
                        {
                            "2 - کدام یک از مهارتها (شایستگیهای) مدیریتی زیر، جهت مهار دشواری های حادثۀ سیل ضروری است؟",
                            "قاطعیت و ثبات رأی", "اقناع کنندگی", "مدیریت بحران توأم با توکل", "تحوّل خواهی انقلابی"
                        }, 3),
                    new DBQuestion(
                        new[]
                        {
                            "3 - یک فرماندۀ ناحیه بسیج که در روزهای پس از سیل استان سیستان از ظرفیت شبکۀ خود در راستای کمک به حلّ بحران های ناشی از سیل بهره می گیرد، کدام یک از موارد ذیل را نمی تواند به شبکه بسپارد؟",
                            "بسترسازی پشتیبانی از شبکه", "رصد و پایش از طریق شبکه", "هماهنگی و برنامه ریزی در شبکه ها",
                            "تصمیم سازی و تصمیم گیری شبکه ای"
                        }, 4),
                    new DBQuestion(
                        new[]
                        {
                            "4 - کدام یک از شایستگی های زیر در بسیج کنندگی نیروها در موقعیت سیل بروز بیشتری دارد؟",
                            "شجاعت", "آشنایی با روش های بوم شناسی", "بصیرت انقلابی", "محاسبه نفس"
                        }, 1),
                    new DBQuestion(
                        new[]
                        {
                            "5 - آیا می توان از ظرفیت خواهران در مدیریت بحران سیل استان سیستان و بلوچستان استفاده کرد؟",
                            "به دلیل خطرناک بودن موقعیت امکان پذیر نیست.", "حتماً و باید از کمک خواهران استفاده کرد.",
                            "شاید در عمل چنین امری محقّق نشود.", "بهتر است این امر بر عهدۀ برادران باقی بماند."
                        }, 2),
                    new DBQuestion(
                        new[]
                        {
                            "6 - کدام یک جزو نقشهای مورد انتظار از یک فرماندۀ اعزام شده به استان سیستان و بلوچستان نیست؟",
                            "شبکه سازی", "رهبری نیروهای داوطلب", "فراخوانی عمومی", "تنویر افکار عمومی"
                        }, 4),
                    new DBQuestion(
                        new[]
                        {
                            "7 - در صورتی که میان افسران، نیروهای داوطلب و افراد بومی، بر سر نحوۀ آذوقه رسانی به مناطق آسیب دیده از سیل اختلافی پیش بیاید، کدام یک از شایستگی های مورد نیاز فرمانده مدیریت موقعیت را برای او هموار می سازد؟",
                            "اصالت و نجابت خانوادگی", "قدرت بیان و اقناع کنندگی بلیغ",
                            "آشنایی با  شبکه های اجتماعی و مجازی", "توانمندی در به کارگیری رشد دهنده"
                        }, 2),
                    new DBQuestion(
                        new[]
                        {
                            "8 - کمک به کنترل و حلّ مشکلات و بحران های اجتماعی مانند پیامدهای ناشی از بلایای طبیعی از جمله سیل استان سیستان نقش متناظر مورد انتظار کدام یک از صفات برجستۀ فرماندهان سپاه است؟",
                            "ظرفیت ساز", "روشنگر", "بسیج کننده", "مربّی"
                        }, 3),
                    new DBQuestion(
                        new[]
                        {
                            "9 - با وجود تفاوت ها در زبان، گویش، فرهنگ و حتّی مذهب اهالی استان سیستان و بلوچستان، فرماندهان نواحی بسیج چگونه می توانند مدیریت بحران سیل را به دست گیرند؟",
                            "با به کارگیری مؤثّر خواهران در انجام مأموریت های سازمان",
                            "با آشنایی با مباحث امنیتی و اطلاعاتی", "با توانمندی در تدبیر و پیش بینی آینده",
                            "با ارتباط گیری و تعامل سازنده"
                        }, 4),
                    new DBQuestion(
                        new[]
                        {
                            "10 - وظیفۀ فرماندهان نواحی و مناطق در استان های مجاور و حتّی غیرمجاور استان سیستان در خصوص سیل چیست؟",
                            "تبیین ناکارآمدی های دستگاه های اجرایی",
                            "فراخوان های عمومی و ایجاد آمادگی های لازم در مخاطبین", "مطالعۀ چالش های زیست محیطی",
                            "درخواست اعزام به موقعیت مسأله"
                        }, 2)
                }, null, null, null, null),
                new Game("یگان ویژه فاتحین", GameStyle.ConnectingPuzzle, null, new[]
                    {
                        new[]
                        {
                            "نقش اصلی یک فرماندۀ میدانی در سوریه در قبال سایر دستگاه های برون مرزی",
                            "تعامل با دیگر دستگاه ها و دفاع از هویت سپاه به نمایندگی از سپاه"
                        },
                        new[]
                        {
                            "مستشاران نظامی نبرد سوریه در کنار فرماندهان نیروهای مسلّح",
                            "مشاور برای فرماندهان ارشد"
                        },
                        new[]
                        {
                            "پیش نیاز ورود افسران ایرانی به جبهه های ارتش سوریه",
                            "شناخت و اشراف به محیط (ظرفیت ها، چالش ها و تهدیدات)"
                        },
                        new[]
                        {
                            "حدّأقل توانمندی اطّلاعاتی در ادارۀ ناحیه",
                            "آشنایی با مباحث امنیتی و اطلاعاتی"
                        },
                        new[]
                        {
                            "تصمیم سازی، تصمیم گیری و صدور دستور",
                            "توانمند در قاطعیت و ثبات رأی"
                        },
                        new[]
                        {
                            "آشنایی با روند شکل گیری گروه های داعش، جبهه النصره، احرارالشام، جیش الفتح، نورالدین زنکی",
                            "کنترل و حل مشکلات و بحران های اجتماعی"
                        },
                        new[]
                        {
                            "وظایف مدیریتی یک رهبر و مدیر",
                            "هدایت، سیاست گذاری و جهت دهی به فعالیت های سازمان"
                        },
                        new[]
                        {
                            "نقش موردانتظار درخصوص جذب بسیجیان و نیروهای داوطلب دفاع از حرم",
                            "جلب و جذب امکانات، نیروها و سرمایه ها"
                        },
                        new[]
                        {
                            "شایستگی فرماندهان جبهۀ مقاومت در قبال فرماندۀ کلّ قوا",
                            "توانمند در تشخیص و اولویت بندی ولایتمدارانه"
                        },
                        new[]
                        {
                            "از جمله رویکردهای فرماندهان در ارائۀ خدمات مستشاری به ارتش سوریه",
                            "مقابله با ناهنجاری ها و برنامه ها و اقدامات ضدارزشی و ضد امنیتی"
                        }
                    }, null, null, null),
                new Game("قرارگاه امنیّتی ثارالله تهران", GameStyle.DropDown, null, null, new []
                {
                    new DBDropDownQuestion("بهترین مبنا برای آغاز گفتمان سازی، توجّه به سخنان ایشان از میان صاحب نظران و اندیشمندان گوناگون سیاسی است", new []
                    {
                        "اندیشمندان صدر اسلام",
                        "امام خمینی(ره) و رهبر انقلاب",
                        "روشنفکران و آزادی خواهان جهان",
                        "افراد تأثیرگذار جناح سیاسی راست"
                    }, 2),
                    new DBDropDownQuestion("در صورتی که مصالح امنیّتی کلّ جامعه ایجاب کند، بهترین تصمیم درخصوص شبکه های اجتماعی است", new []
                    {
                        "آزادی کامل شبکه های اجتماعی",
                        "مسدودسازی همگانی و دائم",
                        "مسدودسازی موقّت و هدفمند",
                        "همکاری با شبکه های اجتماعی"
                    }, 3),
                    new DBDropDownQuestion("مهم ترین درخواست و مطالبه از تمامی دولت ها و در تمام زمان ها", new []
                    {
                        "اصلاح وضعیت معیشت مردم",
                        "کاهش قیمت ارزاق و انرژی",
                        "توسعۀ اقتصادی- اجتماعی",
                        "مطالبه گری آرمان های انقلاب اسلامی"
                    }, 4),
                    new DBDropDownQuestion("شبکه های اجتماعی مجازی از دیدگاه مقام معظّم رهبری این گونه است", new []
                    {
                        "فرصتی است که تهدیدهایی نیز دارد",
                        "تهدیدی است که فرصت هایی نیز دارد",
                        "نمونۀ بارزی از تهاجم فرهنگی است",
                        "ابزار سلطۀ استکبار جهانی است"
                    }, 1),
                    new DBDropDownQuestion("کسانی که در آبان ماه 1398 در خیابان های کشور حضور یافتند، مشتمل بر گروه هایی بودند از", new []
                    {
                        "اراذل، اوباش، مزدوران و مجرمان",
                        "گروهک های تروریستی ضدّ انقلاب",
                        "مردم عادّی که از وضعیت معیشت خود به ستوه آمده بودند",
                        "تمامی موارد مذکور"
                    }, 4),
                    new DBDropDownQuestion("اصل تصمیم و شیوۀ اجرای تصمیم دولت دوازدهم درخصوص افزایش قیمت حامل های انرژی این گونه بوده است", new []
                    {
                        "اصل تصمیم و شیوۀ اجرا هر دو غلط",
                        "اصل تصمیم و شیوۀ اجرا هر دو صحیح",
                        "اصل تصمیم غلط و شیوۀ اجرا صحیح",
                        "اهل تصمیم صحیح و شیوۀ اجرا غلط"
                    }, 4),
                    new DBDropDownQuestion("مهم ترین عاملی که می توانست روزهای آبان 1398 را طور دیگری و بدون آشوب، خشونت و خون ریزی رقم زند", new []
                    {
                        "دولت اصولگرا و سنّتی",
                        "رسانه های جمعی",
                        "مجلس انقلابی و متعهّد",
                        "وزیر نفت جوان و مستقل"
                    }, 2),
                    new DBDropDownQuestion("در روزهای پس از آشوب های آبان 98، این نقش پاسداران انقلاب اسلامی بیش از قبل می باید مورد توجّه ایشان قرار می گرفت", new []
                    {
                        "گفتمان سازی در سطح جامعه",
                        "تأمین و مبارزه با اعتراضات",
                        "بسیج کنندگی و ساماندهی",
                        "مربّی گری و تربیّت نیرو"
                    }, 1),
                    new DBDropDownQuestion("نقش خواهران در گفتمان سازی اجتماعی پیرامون آبان 98 این گونه تبیین می شود", new []
                    {
                        "خواهران به نقش های همسری و مادری خود بپردازند",
                        "به دلیل وجود خشونت در حوادث، خوهران به موضوع ورود نکنند",
                        "حتماً خواهران در گفتمان سازی اجتماعی نقش ایفا نمایند",
                        "مشارکت خواهران در چنین مأموریت هایی اختیاری است"
                    }, 3),
                    new DBDropDownQuestion("در گفت وگو پیرامون گرانی بنزین، آن چه اهمیت دارد", new []
                    {
                        "نقد صریح و گستردۀ عملکرد دولت دوازدهم",
                        "دفاع از اصل تصمیم حاکمیت",
                        "مقایسۀ عملکرد دو جناح سیاسی",
                        "تشریح وضعیت سخت معیشت آحاد مردم"
                    }, 2),
                }, null, null),
                new Game("قرارگاه جذب سلمان", GameStyle.Type, null, null, null, new[]
                {
                    new []{"در امر کادرسازی و ظرفیت سازی، علاوه بر نواحی سپاه، کادرسازی برای این نهاد نیز ضروری است:", "بسیج"},
                    new []{"از جمله وظایف اصلی فرماندهی در خصوص ارزش های اسلامی و انقلابی:", "نهادینه سازی"},
                    new []{"علاوه بر تلاش ها و توسعۀ فردی، از فرماندهان نیز انتظار می رود تا به این امر خطیر بپردازند:", "پرورش استعدادها"},
                    new []{"جزء لاینفک نقش های مدیریتی و فرماندهی در سپاه پاسداران انقلاب اسلامی و نقشی اساسی در راستای ظرفیت سازی و به کارگیری بهینه ظرفیت های موجود است:", "نیروسازی"},
                    new []{"خروجی فرایندهای قرارگاه جذب سلمان، می تواند نقش مهمّی در این حوزه در سپاه ایفا نماید:", "تصمیم سازی"},
                    new []{"قرارگاه جذب سلمان، در نقش فراسازمانی خود، تقویت این تشکّل ها را برعهده دارد:", "حاکمیتی"},
                    new []{"برنامه ریزی برای تعالی و رشد این بخش از سازمان از جمله نقش های مورد انتظار در کادرسازی قرارگاه جذب سلمان است:", "سرمایه انسانی"},
                    new []{"فرماندهان قرارگاه جذب سلمان باید دارای شایستگی هایی از جمله توانمندی در این امر باشند:", "شبکه سازی"},
                    new []{"این توانمندی در کنار کار تشکیلاتی و تربیتی برای یافتن نخبگان جهت جذب در قرارگاه سلمان ضروری است:", "ارتباط گیری"},
                    new []{"مهارت و شایستگی مدیران در تمام سطوح سازمان از جمله در نقش کادرسازی و ظرفیت سازی:", "تعامل سازنده"}
                }, null),
                new Game("ناحیۀ مقاومت بسیج جماران", GameStyle.DragNDrop, null, null, null, null, new []
                {
                    "برنامه ریزی راهبردی در حوزه های گوناگون پیش از ورود به مرحله انتخابات",
                    "ایجاد زیر ساخت های علمی جهت بهره گیری از اندیشمندان حوزه و دانشگاه",
                    "تبیین مبانی دینی و انقلابی پیش از ورود به عرصه سیاسی - اجتماعی",
                    "تبیین و تنویر افکار پاسداران و بسیجیان جهت تمهید انتخابات",
                    "بصیرت بخشی و ایجاد هوشیاری در آحاد مردم",
                    "حفظ بی طرفی جناحی در سطح سازمانی و ملاک قرار دادن منویات مقام مهظم رهبری در انتخاب فردی",
                    "مدیریت امنیت و سلامت برگزاری انتخابات در حوزه های مربوطه",
                    "حفظ ارتباط با نماینده برگزیده حهت کمک به حل مشکلات منطقه و مردم",
                    "مداومت در زنده نگه داشتن روحیه آرمان خواهی و مطالبه گری سیاسی - اجتماعی",
                }),
                new Game("بسیج سازندگی سپاه محمّد رسول الله (ص)", GameStyle.Question, new []
                {
                    new DBQuestion(new []
                    {
                        "1 - »ناصر بودن« و »خادم بودن« در زلزلۀ کرمانشاه نقش آفرینی جدی در کدام حوزه است؟",
                        "پاسخ گویی به تهدیدات سخت و نرم",
                        "خدمت رسانی به مردم ",
                        "رهبری آحاد جامعه",
                        "مطالبه گری و پاسخ گویی"
                    }, 2), 
                    new DBQuestion(new []
                    {
                        "2 - شرایط ویژۀ خدمت و نصرت در زلزلۀ کرمانشاه چگونه است؟",
                        "شرایط ثابت",
                        "شرایط ناپایدار",
                        "شرایط بحرانی",
                        "متغیّر و متلاطم"
                    }, 3), 
                    new DBQuestion(new []
                    {
                        "3 - در  انجام ماموریت های ابلاغی در موضوع زلزلۀ کرمانشاه شراکت با کدام یک از موارد زیر حیاتی است؟",
                        "شرکت های عمرانی خصوصی",
                        "سازمان های نظامی و انتظامی",
                        "سازمان های مردم نهاد",
                        "نهادهای حاکمیتی"
                    }, 4), 
                    new DBQuestion(new []
                    {
                        "4 - در ساخت منازل جایگزین برای زلزله زدگان کدام یک از آورده های معنوی ذیل نیز مورد نظر است؟",
                        "افزایش منزلت اجتماعی سپاه",
                        "خدمت به آحاد ملّت ایران",
                        "تقویت بصیرت انقلابی",
                        "محاسبه نفس و ارزیابی عملکرد"
                    }, 1), 
                    new DBQuestion(new []
                    {
                        "5 - تعامل ناصران و خادمان در کنترل بحران زلزله با سایر دستگاه های اجرایی چگونه است؟",
                        "مطرح نمودن انتقادهای سازنده به دستگاه های اجرایی",
                        "تعامل با دستگاه های اجرایی و وقوف به نواقص آن ها",
                        "فعالیّت مستقل از دستگاه های اجرایی",
                        "بسته به شرایط، تمامی موارد بالا"
                    }, 2), 
                    new DBQuestion(new []
                    {
                        "6 - کدام یک جزو نقش های مورد انتظار از یک فرماندۀ اعزام شده به استان کرمانشاه نیست؟",
                        "کمک به تقویت نهادهای حاکمیتی و ادارۀ جامعه ",
                        "امیدبخشی و نشاط و انگیزه به مردم و مسئولین",
                        "شراکت با دستگاه های اجرایی در انجام مأموریت ها",
                        "بسترسازی برای جذب و عملیاتی شدن ایده های نو"
                    }, 4), 
                    new DBQuestion(new []
                    {
                        "7 - ایفای نقش »خدمت« در موردکاوی بلایای طبیعی در کدام یک از نهادهای انقلابی زیر متجلّی است؟",
                        "بسیج دانشجویی",
                        "جهاد سازندگی",
                        "پدافند غیرعامل",
                        "قرارگاه سازندگی"
                    }, 2), 
                    new DBQuestion(new []
                    {
                        "8 - پیشگامی در خدمت رسانی به مردم  به ویژه در حوادث غیرمترقّبه نشانگر کدام یک از نقش های برجستۀ فرماندهان سپاه است؟",
                        "ظرفیت سازی",
                        "روشنگری و بصیرت بخشی",
                        "نصرت و خدمت",
                        "مربّی گری"
                    }, 3), 
                    new DBQuestion(new []
                    {
                        "9 - فرماندهان نواحی بسیج چگونه می توانند مدیریت بحران زلزلۀ کرمانشاه را به دست گیرند؟",
                        "با تحوّل خواهی انقلابی",
                        "با آشنایی با مباحث امنیتی و اطلاعاتی",
                        "با توانمندی در تدبیر و پیش بینی آینده",
                        "با آشنایی با نظام اداری و مدیریت کشور"
                    }, 4), 
                    new DBQuestion(new []
                    {
                        "10 - کدام یک جزو شایستگی های موردانتظار فرماندهان نواحی و مناطق در استان های مجاور و حتّی غیرمجاور استان کرمانشاه در خصوص زلزله نیست؟",
                        "آشنایی با روش های بوم شناسی ",
                        "فراخوان های عمومی و ایجاد بصیرت لازم در مخاطبین",
                        "توانمند در ارتباط گیری و تعامل سازنده",
                        "توانمند در برآورد داشتن نسبت به محیط و ناحیه"
                    }, 2)
                }, null, null, null, null),
                new Game("بسیج جامعه پزشکی کشور", GameStyle.ConnectingPuzzle, null, new []
                {
                    new []
                    {
                        "مهم ترین ویژگی نقش مطالبه کننده و پیشبرنده به ویژه در بحران کروناویروس جدید ",
                        "نقش آفرینی جدّی و سریع"
                    },
                    new []
                    {
                        "روحیۀ بسیج جامعۀ پزشکی در قالب نقش پیشبرندگی با الگوگیری از این انگاره است.",
                        "روحیۀ جهادی و عاشورایی"
                    },
                    new []
                    {
                        "از جمله نقش های مدیریتی موردانتظار در بحث پیشبرندگی",
                        "مدیریت بحران و حفظ آمادگی برای بحران ستیزی"
                    },
                    new []
                    {
                        "مطالبه کننده و پیشبرنده به این موضوع توجّه ویژه دارد.",
                        "ایجاد و توسعۀ زیرساختی به ویژه زیرساخت های علمی"
                    },
                    new []
                    {
                        "تصمیم سازی، تصمیم گیری و صدور دستور",
                        "توانمند در قاطعیت و ثبات رأی"
                    },
                    new []
                    {
                        "شایستگی محوری در ایفای نقش بسیج جامعۀ پزشکی کشور در مدیریت بحران",
                        "تحوّل خواهی انقلابی"
                    },
                    new []
                    {
                        "نقش مطالبه کننده در حوزۀ خطرپذیری و برنامه های جدید",
                        "مبارزه با آسیب روزمرگی در برنامه ها و تلاش برای ارتقای ریسک پذیری در مواجهه با برنامه های جدید"
                    },
                    new []
                    {
                        "بهبود مستمر فرماندهان ناحیه در چه حیطه ای معنا دارد؟",
                        "فرایندهای سازمانی و محیط پیرامونی ناحیه"
                    },
                    new []
                    {
                        "از جمله شایستگی های موردنیاز بسیجیان جامعۀ پزشکی و فرماندهان بسیجی مقابله با بحران کروناویروس",
                        "تسلط به مبانی فکری و مسایل  انقلاب اسلامی"
                    },
                    new []
                    {
                        "نوع نگاه پیشبرنده به مسائل انقلاب اسلامی",
                        "نگاه منتقدانه و سازنده به مسائل"
                    }
                }, null, null, null),
                new Game("ستاد کلّ راهیان نور", GameStyle.DropDown, null, null, new []
                {
                    new DBDropDownQuestion("فرماندۀ ناحیه در سیر رشد و ارتقای خود به درجات و مناصب بالاتر این گونه شناخته می شود:", new []
                    {
                        "الگوی رفتاری در زمینه های تخصصی و اخلاقی",
                        "تأییدکننده و تأییدشونده",
                        "روشنفکر، آزادی خواه و آرمان طلب",
                        "فردی تأثیرگذار بر جناح های سیاسی"
                    }, 1), 
                    new DBDropDownQuestion("مربّی نیروها و بسیجیان در شجرۀ صالحین، این نقش اصلی را در طول زمان تحقّق می بخشد:", new []
                    {
                        "ناصر و خادم",
                        "اسوه و مربّی",
                        "مراقب و دیده بان",
                        "الگوساز"
                    }, 2), 
                    new DBDropDownQuestion("کسی که به عنوان مربّی در برگزاری اردوهای راهیان نور همکاری دارد، حتماً این حقیقت بیش از سایر جنبه ها در او متبلور است:", new []
                    {
                        "توانمند در برآورد داشتن نسبت به محیط و ناحیه",
                        "اهل خلاقیت، نوآوری و کیاست",
                        "رعایت تمام الزامات شرعی و انقلابی",
                        "تقید به امانت داری در بیت المال"
                    }, 3), 
                    new DBDropDownQuestion("یک فرد اسوه در فضای سپاه پاسداران انقلاب اسلامی:", new []
                    {
                        "جاذبه و دافعه انقلابی دارد.",
                        "جاذبۀ انقلابی دارد.",
                        "دافعۀ انقلابی دارد.",
                        "ممکن است جاذبه و دافعه انقلابی داشته باشد."
                    }, 1), 
                    new DBDropDownQuestion("راویان، فرماندهان، مسؤولان و تمامی افراد دست اندرکار در برگزاری راهیان نور این شایستگی ها را دارند:", new []
                    {
                        "توانمند در ارتباط گیری و تعامل سازنده",
                        "تقید به واجبات شرعی و ترک محرمات",
                        "اهل صدق در قول و عمل",
                        "تمامی موارد مذکور"
                    }, 4), 
                    new DBDropDownQuestion("امیدبخشی و ایجاد نشاط و انگیزه در مردم و مسئولین از زبان فرماندهان این مجموعه باید بیشتر شنیده  شود:", new []
                    {
                        "بسیج جامعۀ پزشکی",
                        "ستاد کلّ راهیان نور",
                        "قرارگاه امنیّتی ثارالله",
                        "معاونت های اداری- مالی"
                    }, 2), 
                    new DBDropDownQuestion("جذب، تربیت، آموزش و سازماندهی مردمی و بسیج:", new []
                    {
                        "شایستگی مطالبه کنندگان و پیش برندگان",
                        "از جمله نقش های مورد نیاز اسوه و مربّی",
                        "وظیفۀ فرماندهان بصیرت بخش",
                        "ویژگی فرماندهان کادرساز"
                    }, 2), 
                    new DBDropDownQuestion("راهیان نور از دیدگاه مقام معظّم رهبری چنین است:", new []
                    {
                        "فناوری استفاده از ثروت عظیم دوران دفاع مقدس ",
                        "درون مایۀ جهاد انقلاب اسلامی ایران",
                        "بستر استعدادیابی جوانان انقلابی",
                        "مسیر پر رهرو و نورانی رزمندگان اسلام"
                    }, 1), 
                    new DBDropDownQuestion("از جمله شایستگی های اخلاقی بنیادین موردنیاز پذیرندگان نقش اسوه و مربّی در کسوت فرماندهی است:", new []
                    {
                        "پیگیری و تلاش مجدّانه",
                        "روحیّۀ فداکاری و تلاشگری",
                        "تقید به واجبات شرعی و ترک محرمات ",
                        "گذشت و شهادت طلبی"
                    }, 3), 
                    new DBDropDownQuestion("ارتباط یک اسوه با حلقه های صالحین بسیج این گونه است:", new []
                    {
                        "نقد صریح و گستردۀ عملکرد حلقه ها",
                        "مربّی گری در حلقه ها",
                        "آگاهی از نوع فعالیت حلقه ها",
                        "مربّی گری و اشراف کامل در حلقه های صالحین"
                    }, 4), 
                }, null, null),
                new Game("قرارگاه قدس جنوب شرق کشور", GameStyle.Type, null, null, null, new []
                {
                    new []{"رصد دائم مراقبتی و دیده بانی فرماندهان نواحی جنوب شرقی کشور بر این حوزه اعمال می شود: ", "محیط پیرامونی"},
                    new []{"چنین مزیّتی جهت مبارزه با گروهک های تروریستی مناطق مرزنشین ضروری است:", "اشراف اطلاعاتی"},
                    new []{"آمادگی کافی جهت اعمال عملیات روانی بر دشمن در مواقع نیاز، از چنین نقشی موردانتظار است:", "مراقب"},
                    new []{"روش شناسی کاربردی فرماندهان نواحی سیستان و بلوچستان در مطالعۀ محیط است:", "روش های بومی"},
                    new []{"لازمۀ ایفای صحیح دیده بانان و مراقبان امنیت کشور:", "حفاظت اطلاعات"},
                    new []{"از جمله شایستگی های موردنیاز ایفای نقش مراقبت در نواحی جنوب شرق کشور، توانمندی در این امر است:", "قضاوت"},
                    new []{"فرماندهان نواحی سپاه به ویژه در مناطق حسّاس سیستان از این نعمت خدادادی بهره مندند:", "بهره هوشی"},
                    new []{"نیاز اولیه رونق اقتصادی و ایجاد امنیت پایدار اقتصادی در مناطق محروم:", "چتر امنیتی"},
                    new []{"آشنایی سیستمی با آن لازمۀ تحقّق و پیشبرد اهداف امنیّتی و اطّلاعاتی است:", "نظام اداری"},
                    new []{"ویژگی بارز شخصیتی فرماندهان طرح امنیتی شهید شوشتری:", "شجاعت"}
                }, null),
                new Game("قرارگاه فرهنگی- اجتماعی قرب بقیۀ الله", GameStyle.DragNDrop, null, null, null, null, new []
                {
                    "مراجعه به منویات مقام معظّم رهبری در امر الگوسازی حاج قاسم",
                    "بهره گیری از اندیشمندان جبهۀ مقاومت جهت تبیین مکتب حاج قاسم",
                    "کسب معرفت و شناخت صحیح از مکتب و مشی حاج قاسم",
                    "ترویج اندیشۀ حاج قاسم در شؤون گوناگون در حرکت درونی سپاه",
                    "ترویج اندیشۀ حاج قاسم در شؤون گوناگون در حرکت بیرونی سپاه",
                    "توجیه و تبیین برنامه های الگو و پایگاه های الگو",
                    "تشویق مستمر برنامه های الگو و پایگاه های الگو",
                    "ارزیابی مستمر فعالیت های زیر مجموعه براساس شاخص های مکتبی",
                    "نقش آفرینی در ساختن جامعه ای رشدیافته و متعالی"
                })
            };
        }

        public class DBQuestion
        {
            public string[] qa;
            public int answer;

            public DBQuestion(string[] q, int a)
            {
                qa = q;
                answer = a;
            }
        }

        public class DBDropDownQuestion
        {
            public string question;
            public string[] answers;
            public int correctOption;

            public DBDropDownQuestion(string q, string[] a, int c)
            {
                question = q;
                answers = a;
                correctOption = c;
            }
        }

        public class Game
        {
            public GameStyle style;

            //public readonly int QualifiedScore;
            public readonly DBQuestion[] dbQuestions;
            public readonly string[][] dbConnectionPuzzle;
            public readonly string[][] dbType;
            public readonly DBDropDownQuestion[] dbDropDownQuestions;
            public readonly string[] dbDragNDropTitles;
            public bool passed;
            public readonly string roomName;
            public int tries;

            public Game(string name, GameStyle s, DBQuestion[] q, string[][] cp, DBDropDownQuestion[] ddq ,string[][] t, string[] dnd)
            {
                style = s;
                //QualifiedScore = minScore;
                dbQuestions = q;
                dbConnectionPuzzle = cp;
                dbDropDownQuestions = ddq;
                dbType = t;
                dbDragNDropTitles = dnd;
                passed = false;
                roomName = name;
                tries = 0;
            }
        }

        public enum GameStyle
        {
            Question,
            DropDown,
            DragNDrop,
            ConnectingPuzzle,
            Type,
            Unassigned
        }
    }
}