namespace MainScripts
{
    public class Stat
    {
        private string playerName;

        public string PlayerName
        {
            get => playerName;
            set
            {
                playerName = value;
                UIManager._.SetPlayerName();
            }
        }

        private int score;

        public int Score
        {
            get => score;
            set
            {
                score = value;
                UIManager._.SetScore();
            }
        }

        private int level;

        public int Level
        {
            get => level;
            set
            {
                level = value;
                UIManager._.SetLevel();
            }
        }


        public readonly Game[] games;
        private static Stat _ins;

        public static Stat Ins
        {
            get
            {
                if (_ins == null)
                    _ins = new Stat();
                return _ins;
            }
        }

        private Stat()
        {
            playerName = "فلان بن فلان";
            score = 0;
            level = 0;

            games = new[]
            {
                new Game("یگان مهندسی نیروی زمینی سپاه تهران", GameStyle.Question, new[]
                {
                    new DBQuestion(
                        new[]
                        {
                            "1 - پس از وقوع سیل در استان سیستان و بلوچستان، کدام یک از انواع شبکه های زیر در بسیج منابع، نقش پررنگ تری خواهد داشت؟",
                            "شبکه های سازمانی", "شبکه های مجازی", "شبکه های دوستانه", "شبکۀ خانوادگی"
                        }, 2),
                    new DBQuestion(
                        new[]
                        {
                            "2 - کدام یک از مهارتها (شایستگیهای) مدیریتی زیر، جهت مهار دشواری های حادثۀ سیل ضروری است؟",
                            "قاطعیت و ثبات رأی", "اقناع کنندگی", "مدیریت بحران توأم با توکل", "تحوّل خواهی انقلابی"
                        }, 3),
                    new DBQuestion(
                        new[]
                        {
                            "3 - یک فرماندۀ ناحیه بسیج که در روزهای پس از سیل استان سیستان از ظرفیت شبکۀ خود در راستای کمک به حلّ بحران های ناشی از سیل بهره می گیرد، کدام یک از موارد ذیل را نمی تواند به شبکه بسپارد؟",
                            "بسترسازی پشتیبانی از شبکه", "رصد و پایش از طریق شبکه", "هماهنگی و برنامه ریزی در شبکه ها",
                            "تصمیم سازی و تصمیم گیری شبکه ای"
                        }, 4),
                    new DBQuestion(
                        new[]
                        {
                            "4 - کدام یک از شایستگی های زیر در بسیج کنندگی نیروها در موقعیت سیل بروز بیشتری دارد؟",
                            "شجاعت", "آشنایی با روش های بوم شناسی", "بصیرت انقلابی", "محاسبه نفس"
                        }, 1),
                    new DBQuestion(
                        new[]
                        {
                            "5 - آیا می توان از ظرفیت خواهران در مدیریت بحران سیل استان سیستان و بلوچستان استفاده کرد؟",
                            "به دلیل خطرناک بودن موقعیت امکان پذیر نیست.", "حتماً و باید از کمک خواهران استفاده کرد.",
                            "شاید در عمل چنین امری محقّق نشود.", "بهتر است این امر بر عهدۀ برادران باقی بماند."
                        }, 2),
                    new DBQuestion(
                        new[]
                        {
                            "6 - کدام یک جزو نقشهای مورد انتظار از یک فرماندۀ اعزام شده به استان سیستان و بلوچستان نیست؟",
                            "شبکه سازی", "رهبری نیروهای داوطلب", "فراخوانی عمومی", "تنویر افکار عمومی"
                        }, 4),
                    new DBQuestion(
                        new[]
                        {
                            "7 - در صورتی که میان افسران، نیروهای داوطلب و افراد بومی، بر سر نحوۀ آذوقه رسانی به مناطق آسیب دیده از سیل اختلافی پیش بیاید، کدام یک از شایستگی های مورد نیاز فرمانده مدیریت موقعیت را برای او هموار می سازد؟",
                            "اصالت و نجابت خانوادگی", "قدرت بیان و اقناع کنندگی بلیغ",
                            "آشنایی با  شبکه های اجتماعی و مجازی", "توانمندی در به کارگیری رشد دهنده"
                        }, 2),
                    new DBQuestion(
                        new[]
                        {
                            "8 - کمک به کنترل و حلّ مشکلات و بحران های اجتماعی مانند پیامدهای ناشی از بلایای طبیعی از جمله سیل استان سیستان نقش متناظر مورد انتظار کدام یک از صفات برجستۀ فرماندهان سپاه است؟",
                            "ظرفیت ساز", "روشنگر", "بسیج کننده", "مربّی"
                        }, 3),
                    new DBQuestion(
                        new[]
                        {
                            "9 - با وجود تفاوت ها در زبان، گویش، فرهنگ و حتّی مذهب اهالی استان سیستان و بلوچستان، فرماندهان نواحی بسیج چگونه می توانند مدیریت بحران سیل را به دست گیرند؟",
                            "با به کارگیری مؤثّر خواهران در انجام مأموریت های سازمان.",
                            "با آشنایی با مباحث امنیتی و اطلاعاتی.", "با توانمندی در تدبیر و پیش بینی آینده.",
                            "ارتباط گیری و تعامل سازنده."
                        }, 4),
                    new DBQuestion(
                        new[]
                        {
                            "10 - وظیفۀ فرماندهان نواحی و مناطق در استان های مجاور و حتّی غیرمجاور استان سیستان در خصوص سیل چیست؟",
                            "تبیین ناکارآمد ی های دستگاه های اجرایی",
                            "فراخوان های عمومی و ایجاد آمادگی های لازم در مخاطبین", "مطالعۀ چالش های زیست محیطی",
                            "درخواست اعزام به موقعیت مسأله"
                        }, 2)
                }, null, null, null, null),
                new Game("یگان ویژه فاتحین", GameStyle.ConnectingPuzzle, null, new[]
                    {
                        new[]
                        {
                            "نقش اصلی یک فرماندۀ میدانی در سوریه در قبال سایر دستگاه های برون مرزی",
                            "تعامل با دیگر دستگاه ها و دفاع از هویت سپاه به نمایندگی از سپاه"
                        },
                        new[]
                        {
                            "مستشاران نظامی نبرد سوریه در کنار فرماندهان نیروهای مسلّح",
                            "مشاور برای فرماندهان ارشد"
                        },
                        new[]
                        {
                            "پیش نیاز ورود افسران ایرانی به جبهه های ارتش سوریه",
                            "شناخت و اشراف به محیط (ظرفیت ها، چالش ها و تهدیدات)"
                        },
                        new[]
                        {
                            "حدّأقل توانمندی اطّلاعاتی در ادارۀ ناحیه",
                            "آشنایی با مباحث امنیتی و اطلاعاتی"
                        },
                        new[]
                        {
                            "تصمیم گیری، تصمیم گیری و صدور دستور",
                            "توانمند در قاطعیت و ثبات رأی"
                        },
                        new[]
                        {
                            "آشنایی با روند شکل گیری گروه های داعش، جبهه النصره، احرارالشام، جیش الفتح، نورالدین زنکی",
                            "کنترل و حل مشکلات و بحران های اجتماعی"
                        },
                        new[]
                        {
                            "وظایف مدیریتی یک رهبر و مدیر",
                            "هدایت، سیاست گذاری و جهت دهی به فعالیت های سازمان"
                        },
                        new[]
                        {
                            "نقش موردانتظار درخصوص جذب بسیجیان و نیروهای داوطلب دفاع از حرم",
                            "جلب و جذب امکانات، نیروها و سرمایه ها"
                        },
                        new[]
                        {
                            "شایستگی فرماندهان جبهۀ مقاومت در قبال فرماندۀ کلّ قوا",
                            "توانمند در تشخیص و اولویت بندی ولایتمدارانه"
                        },
                        new[]
                        {
                            "از جمله رویکردهای فرماندهان در ارائۀ خدمات مستشاری به ارتش سوریه",
                            "مقابله با ناهنجاری ها و برنامه ها و اقدامات ضدارزشی و ضد امنیتی"
                        }
                    }, null, null, null),
                new Game("قرارگاه امنیّتی ثارالله تهران", GameStyle.DropDown, null, null, new []
                {
                    new DBDropDownQuestion("بهترین مبنا برای آغاز گفتمان سازی، توجّه به سخنان ایشان از میان صاحب نظران و اندیشمندان گوناگون سیاسی است", new []
                    {
                        "اندیشمندان صدر اسلام",
                        "امام خمینی(ره) و رهبر انقلاب",
                        "روشنفکران و آزادی خواهان جهان",
                        "افراد تأثیرگذار جناح سیاسی راست"
                    }, 2),
                    new DBDropDownQuestion("در صورتی که مصالح امنیّتی کلّ جامعه ایجاب کند، بهترین تصمیم درخصوص شبکه های اجتماعی است", new []
                    {
                        "آزادی کامل شبکه های اجتماعی",
                        "مسدودسازی همگانی و دائم",
                        "مسدودسازی موقّت و هدفمند",
                        "همکاری با شبکه های اجتماعی"
                    }, 3),
                    new DBDropDownQuestion("مهم ترین درخواست و مطالبه از تمامی دولت ها و در تمام زمان ها", new []
                    {
                        "اصلاح وضعیت معیشت مردم",
                        "کاهش قیمت ارزاق و انرژی",
                        "توسعۀ اقتصادی- اجتماعی",
                        "مطالبه گری آرمان های انقلاب اسلامی"
                    }, 4),
                    new DBDropDownQuestion("شبکه های اجتماعی مجازی از دیدگاه مقام معظّم رهبری این گونه است", new []
                    {
                        "فرصتی است که تهدیدهایی نیز دارد",
                        "تهدیدی است که فرصت هایی نیز دارد",
                        "نمونۀ بارزی از تهاجم فرهنگی است",
                        "ابزار سلطۀ استکبار جهانی است"
                    }, 1),
                    new DBDropDownQuestion("کسانی که در آبان ماه 1398 در خیابان های کشور حضور یافتند، مشتمل بر گروه هایی بودند از", new []
                    {
                        "اراذل، اوباش، مزدوران و مجرمان",
                        "گروهک های تروریستی ضدّ انقلاب",
                        "مردم عادّی که از وضعیت معیشت خود به ستوه آمده بودند",
                        "تمامی موارد مذکور"
                    }, 4),
                    new DBDropDownQuestion("اصل تصمیم و شیوۀ اجرای تصمیم دولت دوازدهم درخصوص افزایش قیمت حامل های انرژی این گونه بوده است", new []
                    {
                        "اصل تصمیم و شیوۀ اجرا هر دو غلط",
                        "اصل تصمیم و شیوۀ اجرا هر دو صحیح",
                        "اصل تصمیم غلط و شیوۀ اجرا صحیح",
                        "اهل تصمیم صحیح و شیوۀ اجرا غلط"
                    }, 4),
                    new DBDropDownQuestion("مهم ترین عاملی که می توانست روزهای آبان 1398 را طور دیگری و بدون آشوب، خشونت و خون ریزی رقم زند", new []
                    {
                        "دولت اصولگرا و سنّتی",
                        "رسانه های جمعی",
                        "مجلس انقلابی و متعهّد",
                        "وزیر نفت جوان و مستقل"
                    }, 2),
                    new DBDropDownQuestion("در روزهای پس از آشوب های آبان 98، این نقش پاسداران انقلاب اسلامی بیش از قبل می باید مورد توجّه ایشان قرار می گرفت", new []
                    {
                        "گفتمان سازی در سطح جامعه",
                        "تأمین و مبارزه با اعتراضات",
                        "بسیج کنندگی و ساماندهی",
                        "مربّی گری و تربیّت نیرو"
                    }, 1),
                    new DBDropDownQuestion("نقش خواهران در گفتمان سازی اجتماعی پیرامون آبان 98 این گونه تبیین می شود", new []
                    {
                        "خواهران به نقش های همسری و مادری خود بپردازند",
                        "به دلیل وجود خشونت در حوادث، خوهران به موضوع ورود نکنند",
                        "حتماً خواهران در گفتمان سازی اجتماعی نقش ایفا نمایند",
                        "مشارکت خواهران در چنین مأموریت هایی اختیاری است"
                    }, 3),
                    new DBDropDownQuestion("در گفت وگو پیرامون گرانی بنزین، آن چه اهمیت دارد", new []
                    {
                        "نقد صریح و گستردۀ عملکرد دولت دوازدهم",
                        "دفاع از اصل تصمیم حاکمیت",
                        "مقایسۀ عملکرد دو جناح سیاسی",
                        "تشریح وضعیت سخت معیشت آحاد مردم"
                    }, 2),
                }, null, null),
                new Game("قرارگاه جذب سلمان", GameStyle.Type, null, null, null, new[]
                {
                    new []{"در امر کادرسازی و ظرفیت سازی، علاوه بر نواحی سپاه، کادرسازی برای این نهاد نیز ضروری است:", "بسیج"},
                    new []{"از جمله وظایف اصلی فرماندهی در خصوص ارزش های اسلامی و انقلابی:", "نهادینه سازی"},
                    new []{"علاوه بر تلاش ها و توسعۀ فردی، از فرماندهان نیز انتظار می رود تا به این امر خطیر بپردازند:", "پرورش استعدادها"},
                    new []{"جزء لاینفک نقش های مدیریتی و فرماندهی در سپاه پاسداران انقلاب اسلامی و نقشی اساسی در راستای ظرفیت سازی و به کارگیری بهینه ظرفیت های موجود است:", "نیروسازی"},
                    new []{"خروجی فرایندهای قرارگاه جذب سلمان، می تواند نقش مهمّی در این حوزه در سپاه ایفا نماید:", "تصمیم سازی"},
                    new []{"قرارگاه جذب سلمان، در نقش فراسازمانی خود، تقویت این تشکّل ها را برعهده دارد:", "حاکمیتی"},
                    new []{"برنامه ریزی برای تعالی و رشد این بخش از سازمان از جمله نقش های مورد انتظار در کادرسازی قرارگاه جذب سلمان است:", "سرمایه انسانی"},
                    new []{"فرماندهان قرارگاه جذب سلمان باید دارای شایستگی هایی از جمله توانمندی در این امر باشند:", "شبکه سازی"},
                    new []{"این توانمندی در کنار کار تشکیلاتی و تربیتی برای یافتن نخبگان جهت جذب در قرارگاه سلمان ضروری است:", "ارتباط گیری"},
                    new []{"مهارت و شایستگی مدیران در تمام سطوح سازمان از جمله در نقش کادرسازی و ظرفیت سازی:", "تعامل سازنده"}
                }, null),
                new Game("ناحیۀ مقاومت بسیج جماران", GameStyle.DragNDrop, null, null, null, null, new []
                {
                    "برنامه ریزی راهبردی در حوزه های گوناگون پیش از ورود به مرحله انتخابات",
                    "ایجاد زیر ساخت های علمی جهت بهره گیری از اندیشمندان حوزه و دانشگاه",
                    "تبیین مبانی دینی و انقلابی پیش از ورود به عرصه سیاسی - اجتماعی",
                    "تبیین و تنویر افکار پاسداران و بسیجیان جهت تمهید انتخابات",
                    "بصیرت بخشی و ایجاد هوشیاری در آحاد مردم",
                    "حفظ بی طرفی جناحی در سطح سازمانی و ملاک قرار دادن منویات مقام مهظم رهبری در انتخاب فردی",
                    "مدیریت امنیت و سلامت برگزاری انتخابات در حوزه های مربوطه",
                    "حفظ ارتباط با نماینده برگزیده حهت کمک به حل مشکلات منطقه و مردم",
                    "مداومت در زنده نگه داشتن روحیه آرمان خواهی و مطالبه گری سیاسی - اجتماعی",
                }),
                new Game("بسیج سازندگی سپاه محمّد رسول الله (ص)", GameStyle.Unassigned, null, null, null, null, null),
                new Game("بسیج جامعه پزشکی کشور", GameStyle.Unassigned, null, null, null, null, null),
                new Game("ستاد کلّ راهیان نور", GameStyle.Unassigned, null, null, null, null, null),
                new Game("قرارگاه قدس جنوب شرق کشور", GameStyle.Unassigned, null, null, null, null, null),
                new Game("قرارگاه فرهنگی- اجتماعی قرب بقیۀ الله", GameStyle.Unassigned, null, null, null, null, null)
            };
        }

        public class DBQuestion
        {
            public string[] qa;
            public int answer;

            public DBQuestion(string[] q, int a)
            {
                qa = q;
                answer = a;
            }
        }

        public class DBDropDownQuestion
        {
            public string question;
            public string[] answers;
            public int correctOption;

            public DBDropDownQuestion(string q, string[] a, int c)
            {
                question = q;
                answers = a;
                correctOption = c;
            }
        }

        public class Game
        {
            public GameStyle style;

            //public readonly int QualifiedScore;
            public readonly DBQuestion[] dbQuestions;
            public readonly string[][] dbConnectionPuzzle;
            public readonly string[][] dbType;
            public readonly DBDropDownQuestion[] dbDropDownQuestions;
            public readonly string[] dbDragNDropTitles;
            public bool passed;
            public readonly string roomName;
            public int tries;

            public Game(string name, GameStyle s, DBQuestion[] q, string[][] cp, DBDropDownQuestion[] ddq ,string[][] t, string[] dnd)
            {
                style = s;
                //QualifiedScore = minScore;
                dbQuestions = q;
                dbConnectionPuzzle = cp;
                dbDropDownQuestions = ddq;
                dbType = t;
                dbDragNDropTitles = dnd;
                passed = false;
                roomName = name;
                tries = 0;
            }
        }

        public enum GameStyle
        {
            Question,
            DropDown,
            DragNDrop,
            ConnectingPuzzle,
            Type,
            Unassigned
        }
    }
}